# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store manager


# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'nvm'
brew 'yarn'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'notion'
cask 'pastebot'
cask 'screenflow'
cask 'slack'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Mac App Store
mas 'Twitter', id: 1482454543
mas 'Final Cut Pro', id: 424389933
