# Development
brew 'coreutils'
brew 'git'
brew 'php'
brew 'curl'
brew 'esphome'
brew 'esptool'
brew 'grep'
brew 'nvm'
brew 'ffmpeg'
brew 'postgresql@17'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'composer'
brew 'mas'

# Casks
cask 'whatsapp'
cask '1password'
cask 'mosaic'
cask 'aldente'
cask 'ngrok'
cask 'alt-tab'
cask 'obs'
cask 'arduino'
cask 'phpstorm'
cask 'bartender'
cask 'spotify'
cask 'chrome-remote-desktop-host'
cask 'stremio'
cask 'google-chrome'
cask 'google-drive'
cask 'visual-studio-code'
cask 'herd'
cask 'vlc'
cask 'insomnia'
cask 'dbngin'
cask 'dbeaver-community'

# Mac App Store
# mas 'Surfshark', id: 1437809329
mas 'Telegram', id: 747648890
mas 'WhatsApp Desktop', id: 1147396723
mas 'Final Cut Pro', id: 424389933
mas 'Compressor', id: 424390742
mas 'Motion', id: 434290957
mas '1Password for Safari', id: 1569813296
# mas 'Logic Pro', id: 634148309
# mas 'MaginStage', id: 634159523
# mas 'GarageBand', id: 682658836
